 ![png](err.png)

In [4]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy_utils import create_database, database_exists

In [14]:
from sqlalchemy import create_engine
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "admin" # (whatever password you chose during mysql installation)
db_name = "demo"
connection_str= f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection_str)

In [15]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

In [16]:
import pandas as pd
df = pd.read_csv('Desktop/Copie de users  - users.csv')
df.head()

   idusers first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [21]:
from sqlalchemy.types import *

# Calculate max string lenghts for object columns
size_length = df['email'].fillna('').map(len).max()
print(size_length)

20

In [22]:
# Create a schema dictionary using SQLAlchemy datatype objects
dtypes_dict = {'idusers': INTEGER(),
               'first_name': VARCHAR(10), 
              '	last_name': VARCHAR(10),
               'email': VARCHAR(50),
               }

In [24]:
# create a connection to the database with the engine
conn = engine.connect()
# save to sql with dtypes and index = False
df.to_sql('users', conn, dtype = dtypes_dict, if_exists = 'replace', index = False)

3

In [26]:
# Add a primary key
q = '''ALTER TABLE users ADD PRIMARY KEY (`idusers`);'''
conn.execute(q)

In [27]:
q = '''DESCRIBE users'''
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0     idusers          int   NO  PRI    None
1  first_name  varchar(10)  YES         None
2   last_name         text  YES         None
3       email  varchar(50)  YES         None

In [28]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_demo
0          users

In [ ]:
df = pd.read_csv('Desktop/Copie de favorites - favorites.csv')
df.head()

In [34]:
# Create a schema dictionary using SQLAlchemy datatype objects
dtypes_dict2 = {'users_iduser': INTEGER(),
               'books_idbooks': INTEGER(),  }
df.to_sql('favorites', conn, dtype = dtypes_dict2, if_exists = 'replace', index = False)

3

In [35]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_demo
0      favorites
1          users

In [36]:
df = pd.read_csv('Desktop/Copie de books - books.csv')
df.head()

   idbooks                 Title  authors_idauthors
0        1           The Shining                  1
1        2                    It                  1
2        3      The Great Gatsby                  2
3        4  The Call of the Wild                  3
4        5   Pride and Prejudice                  4

In [38]:
# Create a schema dictionary using SQLAlchemy datatype objects
dtypes_dict3 = {'idbooks': INTEGER(),
               'Titlee': VARCHAR(100), 
              '	authors_idauthors': INTEGER(),
               }
df.to_sql('books', conn, dtype = dtypes_dict3, if_exists = 'replace', index = False)

6

In [39]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_demo
0          books
1      favorites
2          users

In [40]:

df = pd.read_csv('Desktop/Copie de authors - authors.csv')
df.head()

   idauthors        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [41]:
# Create a schema dictionary using SQLAlchemy datatype objects
dtypes_dict4 = {'idauthors': INTEGER(),
               'author_name': VARCHAR(100), 
             
               }
df.to_sql('author', conn, dtype = dtypes_dict3, if_exists = 'replace', index = False)

5

In [42]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_demo
0         author
1          books
2      favorites
3          users

In [ ]:
conn.close()